app/controllers/booklists_controller.rb

  def index
    @booklists = Booklist.all
    @booklists = Booklist.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "booklists".* FROM "booklists" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "booklists"

  def create
    @booklist = Booklist.new(booklist_params)

    if @booklist.save
---
INSERT INTO "booklists" ("ISBN", "genre", "title", "author", "pages", "year", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @booklist.update(booklist_params)
---
UPDATE "booklists" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "booklists"."id" = ?

  def destroy
    @booklist.destroy
---
DELETE FROM "booklists" WHERE "booklists"."id" = ?  [["id", 3]]

    def set_booklist
      @booklist = Booklist.find(params[:id])
---
SELECT  "booklists".* FROM "booklists" WHERE "booklists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]