app/controllers/comments_controller.rb

	def create
		@booklist = Booklist.find(params[:booklist_id])
		@comment = @booklist.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "booklists".* FROM "booklists" WHERE "booklists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "booklist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Calvin"], ["body", "This is a nice book"], ["booklist_id", 1], ["created_at", 2017-04-10 13:25:33 UTC], ["updated_at", 2017-04-10 13:25:33 UTC]]

	def destroy
		@booklist = Booklist.find(params[:booklist_id])
		@comment = @booklist.comments.find(params[:id])
		@comment.destroy
---
SELECT  "booklists".* FROM "booklists" WHERE "booklists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."booklist_id" = ? AND "comments"."id" = ? LIMIT ?  [["booklist_id", 7], ["id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 8]]